tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
brew "openssl"
brew "awscli"
brew "azure-cli"
brew "carthage"
brew "cliclick"
brew "cocoapods"
brew "composer"
brew "coreutils"
brew "curl"
brew "findutils"
brew "gettext"
brew "ghq"
brew "git"
brew "gnu-sed", args: ["with-default-names"]
brew "go"
brew "hub"
brew "jq"
brew "less"
brew "lesspipe"
brew "mysql"
brew "nkf"
brew "peco"
brew "pkg-config"
brew "sbt"
brew "scala"
brew "sox"
brew "terraform"
brew "thefuck"
brew "travis"
brew "tree"
brew "wget"
brew "zeromq"
brew "zsh"
brew "azure/functions/azure-functions-core-tools"
cask "gimp"
cask "iterm2"
cask "jad"
cask "mysqlworkbench"
